words_base = {
    1: "Давай-ка я подскажу тебе по поводу фильтров..\n" + \
       "<b>Негатив</b> - самый простой, значения каналов цвета" + \
       "меняются на противоположные\n" + \
       "<b>Гамма-фильтр</b> - в зависимости от коэффициента гамма меняется интенсивность " + \
       "(яркость) изображения " + \
       "посветлее, потемнее, всё такое..\n" + \
       "<b>Чёрно-белый</b> - черного-белое изображение\n" + \
       "<b>Средний сдвиг</b> - скажу по-научному, он заменяет каждый пиксель средним " + \
       "значением пикселей в своей окрестности матрицы радиуса r 🧐." + \
       "В общем сглаживает фото\n" + \
       "<b>Цветовой диапазон</b> - да тут легко, эта штука выделяет диапазон цветов, " + \
       "который ты прикажешь " + \
       "и на картинке красит его в белый." + \
       "Многого от нее не ожидай, это же альфа-версия 🙄\n" + \
       "<b>Пикселизация</b> - заставит тебя прочувствоваться ностальгией мира " + \
       "пиксельных игр. Осторожно, затягивает!\n" + \
       "<b>Мультиколизация</b> - делает изображение близким к стилю Хаяо Миядзаки" + \
       "Иногда мне лень так обрабатывать изображение, " + \
       "особенно большие, так что будь терпим\n" + \
       "<b>Морфология</b> - это.. это.. целый мир. Тут есть 3 из 6 типов " + \
       "морфологии (другие мне не нравятся). Если правильно управляться с параметрами, " + \
       "то можно можно получить что-то адекватное, так что иди, дерзай\n" + \
       "<b>Выделить границы</b> - применяю крутой оператор Собеля. " + \
       "Он умеет выделять границы картинки\n",
    # Icecream
    2: "Упс, я уже все съела",
    3: "Думаешь что-то изменилось, пупсик?",
    # Image input
    4: "Ну давай, кинь свою картинку",
    5: "Фото добавлено, братик, без слёз не взглянешь, дайка я поработаю",
    # Errors
    6: "Ты слишком торопишься, я не такая",
    7: "У меня не получилось загрузить изображение, ты был слишком резок.. \n Попробуй другое 😟",
    8: "Файл не читается",
    9: "Файл не записывается",
    # Image processing
    10: "Ммм, какая красивая фоточка",
    11: "Ничего себе как я могу",
    12: "О да, я даже не ожидала, что так хорошо получится",
    13: "Ах, как же я хорошо поработала",
    14: "Ты уже использовал этот фильтр, имей совесть! Я тут не без дела сижу ...",
    15: "Я что тебе робот туда сюда ее преобразовывать?",
    # Исходник
    16: "С такого ракурса стало только хуже)",
    # Morphologia
    17: "А какой именно тебя интересует?",
    18: "С каким ядром и сколько раз ты хочешь применить эту морфологию?\n" + \
        "'Нечетное число + любое число: от единицы до ста', например, вот так: 7 8\n" + \
        "Ну или доверься профессионалу и нажми на кнопку 'поработай'",
    19: "Я такого не знаю, повтори-ка",
    20: "Ты неправильно меня понял, попробуй ещё раз",
    # Color_range
    21: "Введи один из цветов радуги, дорогуша",
    22: "Сказала же, цвета радуги \n Каждый охотник желает знать..",
    # Gamma
    23: "Введи свое значение гамма, сладкий",
    24: "Ага, ноль, хорошо ты придумал..",
    25: "Гамма это просто число!",
    26: "Издеваешься, да?",
    # Pixel
    27: "Подрегулируй уровень пикселизации, введи число, нуу скажем, до 32",
    28: "Для кого я кнопки отправляла?",
    # Reset and I'm tired
    29: "Ладно, ладно. Что ты так завёлся",
    30: "Бедненький, давай я тебя помогу тебе расслабиться ...",
    # Don't know what to do
    31: "Я не знаю что ответить 😢\n" + \
        "Доступные команды: \n/start - полная перезагрузка \n" + \
        "/help - информация о достурных фильтрах",
    # mean_shift
    32: "Сколько раз хочешь хочешь, мм?",
    33: "Может ты еще и бесконечный двигатель изобретешь?",
    34: "Ого, какое больше число, а можно поменьше?"
}

if __name__ == '__main__':
    print("Это баааза")
